Tekla.Structures.DrawingInternal.AreWeUnitTesting
This is to enable unit-testing specific features like faking TS connection.
This class hold a flag that is set to true when user wants to prevent
DelegateProxy's static constructor from running and creating IPC connection.

Tekla.Structures.DrawingInternal.AreWeUnitTesting.Value
Gets or sets a value indicating whether we are running in unit testing
environment where ICDelegate is replaced with a fake.